src/Enums/СтатусыОбработкиЗапросовНаАкцепт/СтатусыОбработкиЗапросовНаАкцепт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработкиЗапросовНаАкцепт</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ЗапросыНаАкцептИБ/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПринятьЗапросНаАкцепт(ДокументСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ТекстJSON = ДокументОбъект.ТелоЗапроса.Получить();
		Если ТипЗнч(ТекстJSON) <> Тип("Строка") Тогда
			ВызватьИсключение "Некорректное тело запроса в документе.";
		КонецЕсли;
		
		ДанныеJSON = РаботаСJSON.РазобратьJSONВСтруктуру(ТекстJSON);
		Если Не РаботаСJSON.ПроверитьСообщениеОт1С(ДанныеJSON) Тогда
			Возврат;
		КонецЕсли;
		
		ИдентификаторИБ = ДанныеJSON.информационнаяБаза.идентификаторИБ;
		СсылкаИБ = ИнформационныеБазы.НайтиЭлементПоИдентификатору(ИдентификаторИБ);
		Если Не СсылкаИБ.Пустая() Тогда
			ВызватьИсключение "Информационная база уже существует.";
		КонецЕсли;
		
		СсылкаИБ = Справочники.ИнформационныеБазы.ПолучитьСсылку(Новый УникальныйИдентификатор);
		
		ИнформационныеБазы.УстановитьБлокировку(ИдентификаторИБ, СсылкаИБ);
		
		ДанныеИБ = ДанныеJSON.информационнаяБаза;
		Период = ТекущаяДатаСеанса();
		Обновлены = РаботаСJSON.ЗаписатьДанныеИнформационнойБазы(ДанныеИБ, СсылкаИБ, Период, ТекстJSON, Истина);
		Если Не Обновлены Тогда
			
			ОтменитьТранзакцию();
			Возврат;
			
		КонецЕсли;
		
		ДокументОбъект.СтатусОбработки = Перечисления.СтатусыОбработкиЗапросовНаАкцепт.Принят;
		ДокументОбъект.ИнформационнаяБаза = СсылкаИБ;
		ДокументОбъект.ПринялРешение = Пользователи.ТекущийПользователь();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнфоОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка принятия запроса на акцепт", УровеньЖурналаРегистрации.Ошибка, , , ИнфоОбОшибке);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтклонитьЗапросНаАкцепт(ДокументСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.СтатусОбработки = Перечисления.СтатусыОбработкиЗапросовНаАкцепт.Отклонен;
		ДокументОбъект.ПринялРешение = Пользователи.ТекущийПользователь();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ИнфоОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка отклонения запроса на акцепт", УровеньЖурналаРегистрации.Ошибка, , , ИнфоОбОшибке);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
